<a href="https://colab.research.google.com/github/nwkrix/pythonbasics/blob/pandas/dframeimport_and_handling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import csv from the web and manipulate the corresponding DataFrame

In [60]:
import pandas as pd
importData = pd.read_csv("https://bit.ly/2JxRhCY")
importData

                  Name Sex  Age City  Donation
0          John, Dough   M   25   NY   3456.98
1       Okafor, Chichi   F   18   EN   1294.15
2         Mandy, Atras   F   26  MXC   5670.27
3        Nwanne, Amaka   F   19   AN    231.78
4  Littletown, Kelechi   M   28  ISB    985.20
5             Odi, Nta   M   30  ABJ    143.12
6           Ali, Janet   F   19   LD    876.11
7       Thomson, Tracy   F   17   CA     34.56
8           Vega, Yess   F   24   HA    234.65

In [5]:
# Selects a series from the DataFrame, importData
importData.Name

0            John, Dough
1         Okafor, Chichi
2           Mandy, Atras
3          Nwanne, Amaka
4    Littletown, Kelechi
5               Odi, Nta
6             Ali, Janet
7         Thomson, Tracy
8             Vega, Yess
Name: Name, dtype: object

In [18]:
# Details about DataFrame & Series
importData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Name        9 non-null object
Sex         9 non-null object
Age         9 non-null int64
City        9 non-null object
Donation    9 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 488.0+ bytes

In [29]:
# Selects only Name from DataFrame from index 7 to the very last
importData.loc[7:,"Name"]

7    Thomson, Tracy
8        Vega, Yess
Name: Name, dtype: object

In [61]:
# Isolate family name from Series importDate.Name
splitName = importData.Name.str.split(',') # note that this is possible because the csv is such that Name has a comma between family name and first name
FamilyName = splitName.apply(lambda x: x[0]) # using lambda fcn, you can as well define your fcn
FamilyName

0          John
1        Okafor
2         Mandy
3        Nwanne
4    Littletown
5           Odi
6           Ali
7       Thomson
8          Vega
Name: Name, dtype: object

In [62]:
# Add new column to the DataFrame (Let's add the FamilyName above in a new column)
importData["Surname"] = FamilyName
importData

                  Name Sex  Age City  Donation     Surname
0          John, Dough   M   25   NY   3456.98        John
1       Okafor, Chichi   F   18   EN   1294.15      Okafor
2         Mandy, Atras   F   26  MXC   5670.27       Mandy
3        Nwanne, Amaka   F   19   AN    231.78      Nwanne
4  Littletown, Kelechi   M   28  ISB    985.20  Littletown
5             Odi, Nta   M   30  ABJ    143.12         Odi
6           Ali, Janet   F   19   LD    876.11         Ali
7       Thomson, Tracy   F   17   CA     34.56     Thomson
8           Vega, Yess   F   24   HA    234.65        Vega